In [1]:
# Use Case Of Pandas 
# * Data Cleaning
# * Data Analysis
# * Data Transformation
# * Data Visualization
# * Data Aggregation
# * File Handling
# * Data Filtering & Selection
# * Time Series Analysis

# Pandas Series -
A series is one dimesional labeled array capable of holding any data type. the axis labels are collectively called the index.

# Creating Series

In [5]:
import numpy as np
import pandas as pd

In [6]:
labels = ['a' , 'b' , 'c']
my_list = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {1:10 , 2:20 , 3:30}

In [8]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [ ]:
# 0, 1 , 2 are labels
# 10, 20, 30 are datapoints

In [9]:
pd.Series(my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr , index = labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)

1    10
2    20
3    30
dtype: int64

# Data Frames -

In [12]:
import numpy as np 
import pandas as pd

In [14]:
data = {
    'Name': ['John ' , 'Divya' , 'Ayushi' , 'Lavi'],
    'Age' : [28 , 21, 21 , 22],
    'City' : ['New York' , 'Gzb' , 'Gzb' , 'Modinagar'],
    'Salary': [10000 , 200000 , 200000 , 250000]
}

In [16]:
df = pd.DataFrame(data)
df

     Name  Age       City  Salary
0   John    28   New York   10000
1   Divya   21        Gzb  200000
2  Ayushi   21        Gzb  200000
3    Lavi   22  Modinagar  250000

In [48]:
data = [
     ['John ', 35, 'New York', 10000] ,
      ['Divya',21,'gzb',200000 ],
      ['Ayushi',21,'gzb',200000 ], 
      ['Lavi',22,'modinagar',250000],
]

In [49]:
df2 = pd.DataFrame(data)
df2

        0   1          2       3
0   John   35   New York   10000
1   Divya  21        gzb  200000
2  Ayushi  21        gzb  200000
3    Lavi  22  modinagar  250000

In [50]:
columns = ['Name','Age','City','Salary']
df2 = pd.DataFrame(data ,columns = columns)
df2

     Name  Age       City  Salary
0   John    35   New York   10000
1   Divya   21        gzb  200000
2  Ayushi   21        gzb  200000
3    Lavi   22  modinagar  250000

Selection and indexing of columns

In [51]:
df2['Name']

0     John
1     Divya
2    Ayushi
3      Lavi
Name: Name, dtype: object

Creating a new column

In [52]:
df2['Designation'] =['doctor' , 'Engineer', 'Crew Member', 'Engineer' ]
df2

     Name  Age       City  Salary  Designation
0   John    35   New York   10000       doctor
1   Divya   21        gzb  200000     Engineer
2  Ayushi   21        gzb  200000  Crew Member
3    Lavi   22  modinagar  250000     Engineer

Removing column

In [53]:
df2.drop('Designation' , axis = 1)

     Name  Age       City  Salary
0   John    35   New York   10000
1   Divya   21        gzb  200000
2  Ayushi   21        gzb  200000
3    Lavi   22  modinagar  250000

In [54]:
df2

     Name  Age       City  Salary  Designation
0   John    35   New York   10000       doctor
1   Divya   21        gzb  200000     Engineer
2  Ayushi   21        gzb  200000  Crew Member
3    Lavi   22  modinagar  250000     Engineer

In [55]:
df2.drop('Designation' , axis = 1, inplace = True)

In [56]:
df2

     Name  Age       City  Salary
0   John    35   New York   10000
1   Divya   21        gzb  200000
2  Ayushi   21        gzb  200000
3    Lavi   22  modinagar  250000

In [57]:
df2.drop(0, axis = 0)      # horizontal

     Name  Age       City  Salary
1   Divya   21        gzb  200000
2  Ayushi   21        gzb  200000
3    Lavi   22  modinagar  250000

Selecting Row

In [58]:
df2.loc[[0]]

    Name  Age      City  Salary
0  John    35  New York   10000

In [59]:
df2.iloc[3]

Name           Lavi
Age              22
City      modinagar
Salary       250000
Name: 3, dtype: object

Selecting subsets of rows and columns

In [60]:
df.loc[[0,2,3]][['Name','Age']]

     Name  Age
0   John    28
2  Ayushi   21
3    Lavi   22

Conditional Selection

In [61]:
# i only want people whose age is above 30 and their city must be paris

In [62]:
df2[df2['Age'] > 30]

    Name  Age      City  Salary
0  John    35  New York   10000

In [65]:
df2[(df2['Age'] > 30) & (df2['City'] == 'Paris')]

Empty DataFrame
Columns: [Name, Age, City, Salary]
Index: []